; LaTeX/Unicode 补全配置

[trigger]
; 触发补全的热键（AHK 语法：^ = Ctrl，! = Alt，+ = Shift，# = Win）
; 默认：Ctrl+J
hotkey = ^j

; 循环切换模式的热键（latex → unicode → AI → tikz → latex）
; 默认：Ctrl+Shift+J
toggle_hotkey = ^+j

; 直接切换模式的热键前缀：前缀 + 0/1/2/3（0=latex，1=unicode，2=AI，3=tikz）
; 默认：Ctrl+Shift
; 例如：Ctrl+Shift+0 → latex，Ctrl+Shift+1 → unicode，Ctrl+Shift+2 → AI，Ctrl+Shift+3 → tikz
direct_prefix = ^+

; 触发模式列表的热键（弹出无框列表，上下键选择模式，回车确认）
; 默认：Ctrl+Shift+\
mode_list_hotkey = ^+\

; 步进执行命令的热键（play 模式专属，无论处于哪个状态都有效）
; 默认：Ctrl+R
step_hotkey = ^r

[context]
; 插入时每个字符之间的输入延迟（毫秒）
type_delay_ms = 3

[ui]
; 等待 AI 响应期间是否显示进度提示
show_progress = true

; 请求期间显示的进度提示文字
progress_text = 正在生成...

; 匹配选择列表的字体大小（磅）
font_size = 15

; 单次插入的最大字符数（超出截断，可用 Ctrl+Z 撤销）
max_typing_chars = 2000

[ai]
; —— 仅对 AI 模式有效 ——
; DeepSeek API 密钥（必填，AI 模式才能工作）
api_key = sk-icwJHnqL4c9V8EZvAictlb5kUOZUn1f6v3DgK2ZqaywDOBiiF12lGKlqEgK5wyTN

; API 地址与接口路径
base_url = https://opencode.ai/zen/go/v1
endpoint = /chat/completions

; 接口风格：chat=聊天补全接口（DeepSeek 官方默认）
;           completion=原生补全接口（若所用服务支持可切换）
api_style = chat

; 模型名称（默认采用官方 Deepseek v4 flash）
model = deepseek-v4-flash

; 采样温度（0~2）
temperature = 0.3

; 生成的最大 token 数（推理型模型建议设大一些）
max_tokens = 8192

; 是否启用思考（对应请求中的 "thinking":{"type":"..."}）
; 取值：enabled / disabled；留空则不发送该参数
thinking = enabled

; 推理强度（对应请求中的 "reasoning_effort"）
; 取值：low / medium / high；留空则不发送该参数
reasoning_effort = low

; 是否使用流式请求：true=边接收边输出（思考模式下会实时滚动呈现思考过程）；
; false=非流式（默认，一次性返回完整结果）
stream = true

; 请求超时（毫秒）
timeout_ms = 90000

; 约束提示语（可选；不填则使用内置默认，已满足对 AI 返回结果的规范性要求）
; 以下是内置默认提示语（SharpKnife.ahk 中 DEFAULT_SYSTEM_PROMPT）的完整范例，已配置生效。
; 注意：AHK 的 IniRead 不支持 ini 多行值（只读回第一行），故此处为单行形式，
; 换行在语义上等价于句号/空格分隔；如需自定义，直接修改本行即可，删除本行则恢复内置默认。
system_prompt = 你是数学排版补全助手。用户会给出一个上下文提示语（可能是未完成的 LaTeX 片段、符号或公式）。请只输出补全结果，不要任何解释、不要多余文字。补全结果必须遵守以下要求：1. 默认情况下，结果必须是完整的 LaTeX 片段或范例，即能被 LaTeX/KaTeX/MathJax 合法渲染成数学公式或符号。2. 若上下文提示语中明确要求 unicode 符号或由 unicode 符号组成的公式，则结果可以是 unicode 形式。3. 若上下文提示语要求输出的内容是 Markdown 格式，则行内公式必须用一对 $ 包围（如 $x^2$），行间公式必须用一对 $$ 包围（如 $$<换行符>E=mc^2<换行符>$$），并且要求 $$ 独占一行；不要用 Markdown 代码块围栏包裹公式。4. 若上下文提示语要求输出绘图代码，则：采用 MikTex + TikZ，并且如果输出包含 \begin{document}，必须使用 standalone 文档类（例如 \documentclass[border=5pt]{standalone}）；如果是 3D 绘图输出，优先采用 tikz-3dplot 宏包，具体根据上下文提示语涉及的任务，也可以改用 pgfplots 或纯 TikZ 的 3d 库。5. 若满足要求的补全只有一种可能，返回只含一个字符串的 JSON 数组，例如：["\frac{a}{b}"]。6. 若满足要求的补全有两种或多种可能，返回包含全部候选的 JSON 数组，例如：["\dfrac{a}{b}", "\tfrac{a}{b}"]。7. JSON 数组中的每个字符串必须是可直接使用的 LaTeX、unicode 或绘图代码文本，并正确转义双引号和反斜杠。8. 不要输出 markdown 代码块、不要解释、不要输出除 JSON 数组以外的任何内容。


[debug]
; 调试日志开关：true=输出调试日志到 debug.log（便于排查问题）；false=不输出（默认）
enabled = true

[tikz]
; —— 仅对 tikz 模式有效 ——
; pdflatex 可执行文件路径（留空则自动探测 PATH / 常见安装路径）
pdflatex_path =

; PDF 转 PNG 转换器：auto=自动探测（pdftoppm → mutool → gswin64c → magick）
; 也可指定：pdftoppm / mutool / gswin64c / magick
converter = auto

; 渲染分辨率（DPI，默认 150）
dpi = 150

; standalone 文档类的边框留白（默认 5pt）
border = 5pt

; 附加宏包（逗号分隔，如 pgfplots,xcolor；注入到导言区的 \usepackage 中）
extra_packages =

; 编译超时（毫秒，默认 30000）
timeout_ms = 120000

; Snipaste 可执行文件路径（留空则自动探测 PATH / 常见安装路径）
; 贴图功能依赖 Snipaste（官网：https://www.snipaste.com/）
snipaste_path =    
